# Operações com DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
dados = {
    'A': np.random.randint(low=500, high = 1500, size = 10 ),
    'B': np.arange(10),
    'C': np.array([1, 7, 2, 3, 11, 91, 10, 8, 54, 27]),
    'D': np.random.randint(low=50, high= 100, size = 10),
    'E': pd.Series([17, 19, 20, 13, 4, 11, 20, 33, 4, 7]),
    'F': [i**3 for i in range(20) if i%2!=0],
}
df = pd.DataFrame(dados)

In [3]:
df

      A  B   C   D   E     F
0   607  0   1  77  17     1
1   907  1   7  99  19    27
2   683  2   2  87  20   125
3  1385  3   3  75  13   343
4  1226  4  11  52   4   729
5  1310  5  91  52  11  1331
6  1166  6  10  50  20  2197
7  1016  7   8  88  33  3375
8   716  8  54  93   4  4913
9   669  9  27  91   7  6859

In [4]:
df.dtypes

A    int32
B    int32
C    int32
D    int32
E    int64
F    int64
dtype: object

In [8]:
df['G'] = df["A"]+df['B']

In [9]:
df

      A  B   C   D   E     F     G
0   607  0   1  77  17     1   607
1   907  1   7  99  19    27   908
2   683  2   2  87  20   125   685
3  1385  3   3  75  13   343  1388
4  1226  4  11  52   4   729  1230
5  1310  5  91  52  11  1331  1315
6  1166  6  10  50  20  2197  1172
7  1016  7   8  88  33  3375  1023
8   716  8  54  93   4  4913   724
9   669  9  27  91   7  6859   678

In [7]:
df['A']+df['B']

0     607
1     908
2     685
3    1388
4    1230
5    1315
6    1172
7    1023
8     724
9     678
dtype: int32

In [6]:
df['A']+1

0     608
1     908
2     684
3    1386
4    1227
5    1311
6    1167
7    1017
8     717
9     670
Name: A, dtype: int32

In [10]:
df['A']/2

0    303.5
1    453.5
2    341.5
3    692.5
4    613.0
5    655.0
6    583.0
7    508.0
8    358.0
9    334.5
Name: A, dtype: float64

In [11]:
df['A']*10

0     6070
1     9070
2     6830
3    13850
4    12260
5    13100
6    11660
7    10160
8     7160
9     6690
Name: A, dtype: int32

In [12]:
df['B']**2

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
Name: B, dtype: int32

In [15]:
df['MEDIA'] = (df['A'] + df['B'] + df['C'])/3

In [17]:
del(df['media'])

In [18]:
df

      A  B   C   D   E     F     G       MEDIA
0   607  0   1  77  17     1   607  202.666667
1   907  1   7  99  19    27   908  305.000000
2   683  2   2  87  20   125   685  229.000000
3  1385  3   3  75  13   343  1388  463.666667
4  1226  4  11  52   4   729  1230  413.666667
5  1310  5  91  52  11  1331  1315  468.666667
6  1166  6  10  50  20  2197  1172  394.000000
7  1016  7   8  88  33  3375  1023  343.666667
8   716  8  54  93   4  4913   724  259.333333
9   669  9  27  91   7  6859   678  235.000000

In [19]:
(df['A']/df['B'])/(df['E']/df['F'])

0             inf
1    1.288895e+03
2    2.134375e+03
3    1.218090e+04
4    5.585963e+04
5    3.170200e+04
6    2.134752e+04
7    1.484416e+04
8    1.099284e+05
9    7.283605e+04
dtype: float64

In [20]:
(df['A']- df['A'].min())/(df['A'].max()-df['A'].min())

0    0.000000
1    0.385604
2    0.097686
3    1.000000
4    0.795630
5    0.903599
6    0.718509
7    0.525707
8    0.140103
9    0.079692
Name: A, dtype: float64

In [24]:
dados ={
    'A':pd.Series([10, 20, 30, 40, 50], index= list('abcde')),
    'B':pd.Series([17, 44, 30, 90, 100, 70, 100], index = list('abcdefg'))
}
df = pd.DataFrame(dados)

In [25]:
df

      A    B
a  10.0   17
b  20.0   44
c  30.0   30
d  40.0   90
e  50.0  100
f   NaN   70
g   NaN  100

In [27]:
df['A']+df['B']

a     27.0
b     64.0
c     60.0
d    130.0
e    150.0
f      NaN
g      NaN
dtype: float64